# JOINS

In [17]:
import mysql.connector as mysql
import pandas as pd
import os
from dotenv import load_dotenv

In [18]:
load_dotenv('/workspaces/IBM-DS-Course/.env')
user=os.getenv('USER')
password=os.getenv('PASSWORD')
host = 'localhost'
port=3306
db = 'HR'

def get_db_connection():
    return mysql.connect(
        host=host, user=user, password=password,port=port, database=db

    )
db = 'HR'
use = f'USE {db}'

In [19]:
!docker stop mysql-container
!docker restart mysql-container
!docker ps

mysql-container
mysql-container
CONTAINER ID   IMAGE     COMMAND                  CREATED      STATUS                  PORTS                                                  NAMES
50e33c579e3f   mysql     "docker-entrypoint.sâ€¦"   3 days ago   Up Less than a second   0.0.0.0:3306->3306/tcp, :::3306->3306/tcp, 33060/tcp   mysql-container

In [22]:
conn = get_db_connection()
cursor = conn.cursor()
cursor.execute(use)

1. Retrieve the names and job start dates of all employees who work for department number 5.

-    We need to use the Inner join operation with the EMPLOYEES table as the left table and the JOB_HISTORY table as the right table.

-    The join will be made over employee ID, and the query response will be filtered for the Department ID value 5.

In [24]:
join_q1 = '''SELECT E.F_NAME,E.L_NAME, JH.START_DATE 
FROM EMPLOYEES as E 
INNER JOIN JOB_HISTORY as JH 
ON E.EMP_ID=JH.EMPL_ID 
WHERE E.DEP_ID ='5';'''

In [25]:
cursor.execute(join_q1)
rspns = cursor.fetchall()
df1 = pd.DataFrame(rspns)
df1

         0      1           2
0    Alice  James  2001-08-01
1    Steve  Wells  2001-08-16
2  Santosh  Kumar  2000-08-16
3      Ann  Jacob  2016-08-16

2. Retrieve employee ID, last name, department ID, and department name for all employees.

-    For this, you must use the Left Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table. The join will happen on the Department ID. The query will be written as follows:

In [26]:
join_q2 = '''SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D 
ON E.DEP_ID=D.DEPT_ID_DEP;
'''

In [27]:
cursor.execute(join_q2)
rspns = cursor.fetchall()
df2 = pd.DataFrame(rspns)
df2

       0        1  2                3
0  E1001   Thomas  2  Architect Group
1  E1002    James  5   Software Group
2  E1003    Wells  5   Software Group
3  E1004    Kumar  5   Software Group
4  E1005  Hussain  2  Architect Group
5  E1006    Allen  2  Architect Group
6  E1007   Thomas  7      Design Team
7  E1008    Gupta  7      Design Team
8  E1009    Jones  7      Design Team
9  E1010    Jacob  5   Software Group

3. Retrieve the First name, Last name, and Department name of all employees.

-    For this, you will use the Full Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table. A full outer join in MySQL is implemented as a UNION of left and right outer joins. The query will be written as shown below.

In [28]:
join_q3 = '''SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID = D.DEPT_ID_DEP
UNION
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
RIGHT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP'''

In [29]:
cursor.execute(join_q3)
rspns = cursor.fetchall()
df3 = pd.DataFrame(rspns)
df3

         0        1                2
0     John   Thomas  Architect Group
1    Alice    James   Software Group
2    Steve    Wells   Software Group
3  Santosh    Kumar   Software Group
4    Ahmed  Hussain  Architect Group
5    Nancy    Allen  Architect Group
6     Mary   Thomas      Design Team
7  Bharath    Gupta      Design Team
8   Andrea    Jones      Design Team
9      Ann    Jacob   Software Group

## Practice Problems

1. Retrieve the names, job start dates, and job titles of all employees who work for department number 5.

In [32]:
p_join1 = '''SELECT E.F_NAME, E.L_NAME, E.DEP_ID, H.START_DATE 
FROM EMPLOYEES AS E
LEFT OUTER JOIN JOB_HISTORY AS H
ON E.EMP_ID = H.EMPL_ID
WHERE E.DEP_ID = 5'''

In [33]:
cursor.execute(p_join1)
rspns = cursor.fetchall()
ans_df1 = pd.DataFrame(rspns)
ans_df1

         0      1  2           3
0    Alice  James  5  2001-08-01
1    Steve  Wells  5  2001-08-16
2  Santosh  Kumar  5  2000-08-16
3      Ann  Jacob  5  2016-08-16

2. Retrieve employee ID, last name, and department ID for all employees but department names for only those born before 1980.

In [50]:
p_join2 = '''SELECT E.EMP_ID , E.L_NAME, D.DEPT_ID_DEP
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS D
ON E.DEP_ID = D.DEPT_ID_DEP AND YEAR(E.B_DATE) < 1980'''

In [51]:
cursor.execute(p_join2)
rspns = cursor.fetchall()
ans_df2 = pd.DataFrame(rspns)
ans_df2

       0        1    2
0  E1001   Thomas  2.0
1  E1002    James  5.0
2  E1003    Wells  NaN
3  E1004    Kumar  NaN
4  E1005  Hussain  NaN
5  E1006    Allen  2.0
6  E1007   Thomas  7.0
7  E1008    Gupta  NaN
8  E1009    Jones  NaN
9  E1010    Jacob  NaN

3. Retrieve the first name and last name of all employees but department ID and department names only for male employees.

In [59]:
p_join3 = '''SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS D
ON E.DEP_ID = D.DEPT_ID_DEP AND E.SEX = "M";'''

In [60]:
cursor.execute(p_join3)
rspns = cursor.fetchall()
ans_df3 = pd.DataFrame(rspns)
ans_df3

         0        1    2                3
0     John   Thomas  2.0  Architect Group
1    Alice    James  NaN             None
2    Steve    Wells  5.0   Software Group
3  Santosh    Kumar  5.0   Software Group
4    Ahmed  Hussain  2.0  Architect Group
5    Nancy    Allen  NaN             None
6     Mary   Thomas  NaN             None
7  Bharath    Gupta  7.0      Design Team
8   Andrea    Jones  NaN             None
9      Ann    Jacob  NaN             None

In [61]:
cursor.close()
conn.close()